## 5.1 pandas 자료구조 소개

표 형식의 데이터나 다양한 형태의 데이터를 다룸
cf)NumPy는 배열 데이터

In [14]:
import pandas as pd 
import numpy as np

In [2]:
from pandas import Series, DataFrame

### 5.1.1 Series

Series : a one-dimensional array-like object containing a sequence of values

In [3]:
obj = pd.Series([4,7,-5,3])

obj

0    4
1    7
2   -5
3    3
dtype: int64

In [5]:
obj.values

array([ 4,  7, -5,  3])

In [6]:
obj.index # like range(4)

RangeIndex(start=0, stop=4, step=1)

In [7]:
#데이터를 지칭하는 색인 별도 지정

obj2 = pd.Series([4,7,-5,3], index = ['d', 'b', 'a', 'c'])

obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [8]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [9]:
#색인으로 값 선택(색인 지정하여 값 변경하는 것도 가능)

obj2[['c','a']]

c    3
a   -5
dtype: int64

In [10]:
obj2[obj2 > 0 ] #색인 이용하여 조건걸기

d    4
b    7
c    3
dtype: int64

In [11]:
obj2 * 2

d     8
b    14
a   -10
c     6
dtype: int64

In [15]:
np.exp(obj2)

d      54.598150
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [16]:
#Series : 고정 길이의 정렬된 사전형으로 생각할 수도 있음

'b' in obj2

True

In [17]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

obj3 = pd.Series(sdata)

obj3 #Series 객체의 색인에는 사전의 키값이 순서대로! 원하는 순서 정할 수도 있음

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [18]:
states = ['California', 'Ohio', 'Oregon', 'Texas']

obj4 = pd.Series(sdata, index = states)

obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [19]:
pd.isnull(obj4) #유사하게 notnull() 사용할 수도 있음

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [20]:
obj4.isnull # Sereies의 인스턴스 메서드로도 존재. notnull도 마찬가지

<bound method Series.isnull of California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64>

In [21]:
#Series는 산술 연산에서 색인과 라벨로 자동 정렬 가능. 알파벳순

obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [22]:
#Series 객체와 Series 색인은 모두 name 속성 있음. pandas 핵심 기능과 연관

obj4.name = 'population'

obj4.index.name = 'state'

obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

### 5.1.2 DataFrame

In [23]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)
#dataframe은 같은 길이의 리스트에 담긴 사전 또는 numpy배열을 이용하여 생성
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [24]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [25]:
pd.DataFrame(data, columns = ['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [31]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'], 
                      index=['one', 'two', 'three', 'four', 'five', 'six'])

frame2 #사전에 없는 값을 넘기면 NA로 저장

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [27]:
#value에 접근하는 방식 두 가지

frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [28]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [29]:
frame2.loc['three'] #index값을 통해 row에 대한 값 반환

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [33]:
frame2['debt'] = np.arange(6.) #column을 지정하여 값 대입

frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [34]:
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])

frame2['debt'] = val #색인으로 값 입력. 존재하지 않는 값은 NA

frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [40]:
frame2['eastern'] = frame2.state == 'Ohio' #존재하지 않는 column에 대해 값 입력하면 새로운 열 생김

frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [41]:
del frame2['eastern'] #del 이용하여 column 삭제

frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [42]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9}, 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}} #중첩된 사전

frame3 = pd.DataFrame(pop)

frame3 #바깥에 있는 사전의 키는 column, 안의 키는 row

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [43]:
frame3.T #전치

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [44]:
frame3.index.name = 'year'; frame3.columns.name = 'state' #name 속성

frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [46]:
frame3.values

array([[2.4, 1.7],
       [2.9, 3.6],
       [nan, 1.5]])

### 5.1.3 색인객체

In [49]:
obj = pd.Series(range(3), index=['a', 'b', 'c'])

index = obj.index #series의 index

index

Index(['a', 'b', 'c'], dtype='object')

In [50]:
index[1:]

Index(['b', 'c'], dtype='object')

In [51]:
index[1] = 'd' #색인 객체는 변경불가!

TypeError: Index does not support mutable operations

## 5.2 핵심 기능

### 5.2.1 재색인

In [52]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])

obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [53]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e']) #series의 메소드인 reindex를 이용하여 새로운 색인에 맞게 재배열 (columne도 변경 가능!)

obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [54]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])

obj3

0      blue
2    purple
4    yellow
dtype: object

In [55]:
obj3.reindex(range(6), method='ffill') #ffill 메서드를 이용해 직전의 값으로 NA 대체

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

### 5.2.2 하나의 행이나 열 삭제하기

In [56]:
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])

obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [57]:
new_obj = obj.drop('c')

new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [64]:
obj.drop(['d', 'c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [59]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])

data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [60]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [61]:
data.drop('two', axis=1) #또는 axis = 'columns'

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

### 5.2.3. 색인하기, 선택하기, 거르기

Series는 numpy배열 색인과 유사하지만 정수가 아니어도 됨!

In [65]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])

obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [66]:
obj['b']

1.0

In [67]:
obj[1]

1.0

In [68]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [69]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [70]:
#라벨 이름으로 슬라이싱하면 시작점과 끝점이 포함됨!!

obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [71]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])

data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [72]:
#dataframe의 column가져오기

data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [73]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [74]:
#row 가져오기

data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [75]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15